/*
 * fun_ADC.h
 *
 * Created: 18.03.2022 11:13:33
 *  Author: durov_av
 */ 

#include <avr/io.h>

#ifndef FUN_ADC_H_
#define FUN_ADC_H_

#define PT1000_0_GRAD	1000 // сопротивление термодатчика при температуре 0 градусов ?ельси¤
#define NAKLON_OM_GRAD	3.792 // наклон характеристики сопротивлени¤ термодатчика, скока ом в плюс при росте тмпрт на 1 градус

 // сопротивление NTC при температурах -10град до 130град,
 //	table_Rntc_Om[0] - при -10град
 //  table_Rntc_Om[1] - при -9град
 //  table_Rntc_Om[10] - при 0град
 //  table_Rntc_Om[35] - при 25град
 //  берём значение ADC,
 //  вычисляем соответствующее ему значение сопротивления,
 //  R = ADC * Rtd_om_RAM_ / (1024 - ADC)
 //  пробегаем по массиву, и находим номер элемента
 //  массив идет от температуры -10градусов, поэтому вычитаем 10, получаем тмпрт
 //  если использовать замер по NTC, то два резистора делитель на ногу 21 надо отпаять, конденсатор оставить
 //
uint16_t table_NTC_Om[141] = {
	 55330,  52399,  49644,  47052,  44614,  42320,  40149,  38104,
	 36178,  34362,  32650,  31025,  29492,  28046,  26680,  25390,
	 24165,  23008,  21914,  20879,  19900,  18968,  18086,  17251,
	 16459,  15710,  14996,  14319,  13677,  13068,  12490,  11939,
	 11416,  10920,  10448,  10000,  9571,   9164,   8776,   8407,
	 8057,   7721,   7401,   7097,   6807,   6531,   6266,   6015,
	 5774,   5545,   5327,   5117,   4917,   4726,   4543,   4369,
	 4201,   4041,   3889,   3742,   3603,   3468,   3339,   3216,
	 3098,   2986,   2877,   2773,   2674,   2579,   2488,   2400,
	 2315,   2235,   2157,   2083,   2011,   1942,   1876,   1812,
	 1752,   1693,   1637,   1583,   1531,   1481,   1432,   1386,
	 1342,   1299,   1258,   1217,   1179,   1142,   1106,   1072,
	 1038,   1006,   976,    946,    917,    889,    863,    837,
	 812,    788,    765,    742,    721,    700,    680,    660,
	 641,    623,    605,    588,    572,    556,    540,    525,
	 511,    497,    483,    470,    457,    445,    433,    421,
	 410,    399,    389,    379,    369,    359,    350,    341,
	 333,    324,    316,    308,    300
 };

#endif /* FUN_ADC_H_ */